detail_data/k6関係/5000_10_2NT.txt

     data_received..................: 10 GB  295 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=42.85µs min=0s      med=0s      max=32.88ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=15.39µs min=0s      med=0s      max=32.33ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.99ms min=24.87ms med=63.51ms max=160.4ms  p(90)=86.42ms p(95)=95.46ms
       { expected_response:true }...: avg=66.99ms min=24.87ms med=63.51ms max=160.4ms  p(90)=86.42ms p(95)=95.46ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=25.03ms min=0s      med=22.05ms max=91.97ms  p(90)=40.23ms p(95)=46.3ms 
     http_req_sending...............: avg=289.4µs min=0s      med=0s      max=42.98ms  p(90)=0s      p(95)=1.03ms 
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.67ms min=9.91ms  med=39.22ms max=102.48ms p(90)=51.41ms p(95)=57.82ms
     http_reqs......................: 5000   146.071384/s
     iteration_duration.............: avg=67.39ms min=43.54ms med=63.83ms max=161.43ms p(90)=86.84ms p(95)=95.9ms 
     iterations.....................: 5000   146.071384/s
     vus............................: 3      min=3         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  299 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=45.55µs  min=0s      med=0s      max=14.32ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=14.2µs   min=0s      med=0s      max=14.32ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.32ms  min=26.91ms med=63.45ms max=150.64ms p(90)=84.08ms p(95)=92.04ms
       { expected_response:true }...: avg=66.32ms  min=26.91ms med=63.45ms max=150.64ms p(90)=84.08ms p(95)=92.04ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.91ms  min=0s      med=22.14ms max=84.64ms  p(90)=39.06ms p(95)=45.11ms
     http_req_sending...............: avg=220.66µs min=0s      med=0s      max=46.67ms  p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.18ms  min=19.74ms med=38.95ms max=124.29ms p(90)=49.74ms p(95)=56.28ms
     http_reqs......................: 5000   147.835909/s
     iteration_duration.............: avg=66.73ms  min=26.91ms med=63.83ms max=150.69ms p(90)=84.75ms p(95)=92.97ms
     iterations.....................: 5000   147.835909/s
     vus............................: 9      min=9         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  286 MB/s
     data_sent......................: 430 kB 12 kB/s
     http_req_blocked...............: avg=49.06µs  min=0s      med=0s      max=44.12ms  p(90)=0s      p(95)=0s      
     http_req_connecting............: avg=18.12µs  min=0s      med=0s      max=39.08ms  p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=69.16ms  min=42.04ms med=65.12ms max=184.9ms  p(90)=92.37ms p(95)=101.35ms
       { expected_response:true }...: avg=69.16ms  min=42.04ms med=65.12ms max=184.9ms  p(90)=92.37ms p(95)=101.35ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=25.61ms  min=2.13ms  med=22.2ms  max=127.58ms p(90)=43.05ms p(95)=49.88ms 
     http_req_sending...............: avg=204.45µs min=0s      med=0s      max=19.45ms  p(90)=0s      p(95)=1.01ms  
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=43.34ms  min=25.72ms med=40.61ms max=146.89ms p(90)=53.75ms p(95)=61.76ms 
     http_reqs......................: 5000   141.677567/s
     iteration_duration.............: avg=69.51ms  min=42.04ms med=65.49ms max=184.9ms  p(90)=92.82ms p(95)=102.24ms
     iterations.....................: 5000   141.677567/s
     vus............................: 2      min=2         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  293 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=51.79µs  min=0s      med=0s      max=48.25ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=9.33µs   min=0s      med=0s      max=5.39ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.77ms  min=43.22ms med=64.04ms max=163.75ms p(90)=88.4ms  p(95)=96.76ms
       { expected_response:true }...: avg=67.77ms  min=43.22ms med=64.04ms max=163.75ms p(90)=88.4ms  p(95)=96.76ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=25.47ms  min=0s      med=22.29ms max=101.98ms p(90)=41.81ms p(95)=48.66ms
     http_req_sending...............: avg=233.18µs min=0s      med=0s      max=33.99ms  p(90)=0s      p(95)=1.01ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=42.06ms  min=4.66ms  med=39.45ms max=139.18ms p(90)=51.96ms p(95)=58.32ms
     http_reqs......................: 5000   145.054941/s
     iteration_duration.............: avg=68.19ms  min=43.34ms med=64.4ms  max=164.41ms p(90)=88.97ms p(95)=97.62ms
     iterations.....................: 5000   145.054941/s
     vus............................: 7      min=7         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  296 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=47.58µs  min=0s      med=0s      max=15.68ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=7.81µs   min=0s      med=0s      max=2.79ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.28ms  min=17.11ms med=64.21ms max=180.22ms p(90)=85.33ms p(95)=94.17ms
       { expected_response:true }...: avg=67.28ms  min=17.11ms med=64.21ms max=180.22ms p(90)=85.33ms p(95)=94.17ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=25.15ms  min=0s      med=22.71ms max=105.4ms  p(90)=39.59ms p(95)=45.84ms
     http_req_sending...............: avg=206.21µs min=0s      med=0s      max=32.76ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.92ms  min=11.5ms  med=39.42ms max=144.44ms p(90)=51.25ms p(95)=58.05ms
     http_reqs......................: 5000   146.679241/s
     iteration_duration.............: avg=67.69ms  min=17.11ms med=64.6ms  max=180.22ms p(90)=86.04ms p(95)=95ms   
     iterations.....................: 5000   146.679241/s
     vus............................: 5      min=5         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  294 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=49.34µs min=0s      med=0s      max=13.94ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=16.52µs min=0s      med=0s      max=13.05ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.48ms min=32.89ms med=63.88ms max=179.66ms p(90)=87.49ms p(95)=96.14ms
       { expected_response:true }...: avg=67.48ms min=32.89ms med=63.88ms max=179.66ms p(90)=87.49ms p(95)=96.14ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.93ms min=0s      med=22.16ms max=99.14ms  p(90)=40.18ms p(95)=46.31ms
     http_req_sending...............: avg=251.5µs min=0s      med=0s      max=37.03ms  p(90)=58.4µs  p(95)=1.02ms 
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=42.3ms  min=10ms    med=39.71ms max=135.05ms p(90)=51.23ms p(95)=58.68ms
     http_reqs......................: 5000   145.355601/s
     iteration_duration.............: avg=67.88ms min=32.88ms med=64.39ms max=179.65ms p(90)=88.18ms p(95)=97.08ms
     iterations.....................: 5000   145.355601/s
     vus............................: 5      min=5         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  295 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=42.65µs  min=0s      med=0s      max=14.71ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=15.39µs  min=0s      med=0s      max=14.71ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=67.28ms  min=42.79ms med=63.44ms max=277.08ms p(90)=86.54ms p(95)=96.56ms
       { expected_response:true }...: avg=67.28ms  min=42.79ms med=63.44ms max=277.08ms p(90)=86.54ms p(95)=96.56ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.83ms  min=1.77ms  med=22.03ms max=181.36ms p(90)=39.5ms  p(95)=46.4ms 
     http_req_sending...............: avg=264.14µs min=0s      med=0s      max=35.99ms  p(90)=0s      p(95)=1.03ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=42.18ms  min=26.88ms med=39.25ms max=194.55ms p(90)=51.81ms p(95)=59.43ms
     http_reqs......................: 5000   145.974178/s
     iteration_duration.............: avg=67.68ms  min=42.79ms med=63.89ms max=277.08ms p(90)=87.14ms p(95)=96.91ms
     iterations.....................: 5000   145.974178/s
     vus............................: 3      min=3         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  298 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=41.77µs min=0s      med=0s      max=10ms     p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=11.75µs min=0s      med=0s      max=9.62ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.42ms min=43.14ms med=62.74ms max=151.12ms p(90)=86.25ms p(95)=95.1ms 
       { expected_response:true }...: avg=66.42ms min=43.14ms med=62.74ms max=151.12ms p(90)=86.25ms p(95)=95.1ms 
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=25.09ms min=9.48ms  med=21.9ms  max=103.93ms p(90)=41.17ms p(95)=48.89ms
     http_req_sending...............: avg=253.7µs min=0s      med=0s      max=49.84ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.07ms min=32.26ms med=38.94ms max=103.84ms p(90)=48.8ms  p(95)=55.28ms
     http_reqs......................: 5000   147.465265/s
     iteration_duration.............: avg=66.83ms min=43.14ms med=63.19ms max=152.56ms p(90)=86.84ms p(95)=96.13ms
     iterations.....................: 5000   147.465265/s
     vus............................: 9      min=9         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  299 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=40.82µs  min=0s      med=0s      max=20.09ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=12.17µs  min=0s      med=0s      max=20.09ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.36ms  min=44.15ms med=62.63ms max=141.16ms p(90)=85.82ms p(95)=95.51ms
       { expected_response:true }...: avg=66.36ms  min=44.15ms med=62.63ms max=141.16ms p(90)=85.82ms p(95)=95.51ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.71ms  min=9.69ms  med=21.51ms max=86.89ms  p(90)=40.27ms p(95)=46.95ms
     http_req_sending...............: avg=271.54µs min=0s      med=0s      max=34.96ms  p(90)=0s      p(95)=1.04ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.37ms  min=19.25ms med=38.88ms max=119.94ms p(90)=50.55ms p(95)=57.78ms
     http_reqs......................: 5000   148.038801/s
     iteration_duration.............: avg=66.79ms  min=44.66ms med=63.01ms max=141.15ms p(90)=86.62ms p(95)=96.11ms
     iterations.....................: 5000   148.038801/s
     vus............................: 9      min=9         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 10 GB  300 MB/s
     data_sent......................: 430 kB 13 kB/s
     http_req_blocked...............: avg=46µs     min=0s      med=0s      max=25.05ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=15.59µs  min=0s      med=0s      max=25.05ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=65.63ms  min=43.64ms med=61.72ms max=175.54ms p(90)=85.44ms p(95)=93.37ms
       { expected_response:true }...: avg=65.63ms  min=43.64ms med=61.72ms max=175.54ms p(90)=85.44ms p(95)=93.37ms
     http_req_failed................: 0.00%  0 out of 5000
     http_req_receiving.............: avg=24.38ms  min=5.96ms  med=21.15ms max=116.35ms p(90)=40.16ms p(95)=46.77ms
     http_req_sending...............: avg=253.42µs min=0s      med=0s      max=44.41ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41ms     min=23.28ms med=38.58ms max=120.24ms p(90)=49.33ms p(95)=56.31ms
     http_reqs......................: 5000   148.48785/s
     iteration_duration.............: avg=66.08ms  min=43.71ms med=62.12ms max=176.07ms p(90)=86.1ms  p(95)=94.2ms 
     iterations.....................: 5000   148.48785/s
     vus............................: 6      min=6         max=10
     vus_max........................: 10     min=10        max=10